Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG128.atdf
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Type" mask="0x00000004" name="CMPTYPE" values="ADC_EMR__CMPTYPE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000001F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Over Sampling Rate" mask="0x00070000" name="OSR" values="ADC_EMR__OSR"/>
          <bitfield caption="Averaging on Single Trigger Event" mask="0x00100000" name="ASTE" values="ADC_EMR__ASTE"/>
          <bitfield caption="External Clock Selection" mask="0x00200000" name="SRCCLK" values="ADC_EMR__SRCCLK"/>
          <bitfield caption="Tracking Time x4, x8 or x16" mask="0x00C00000" name="TRACKX" values="ADC_EMR__TRACKX"/>
          <bitfield caption="ADC_LCDR Tag" mask="0x01000000" name="TAG"/>
          <bitfield caption="Sign Mode" mask="0x06000000" name="SIGNMODE" values="ADC_EMR__SIGNMODE"/>
          <bitfield caption="ADC Running Mode" mask="0x30000000" name="ADCMODE" values="ADC_EMR__ADCMODE"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x54" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x0000FFFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0xFFFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Configuration Register" name="ADC_CCR" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Differential Inputs for Channel 0" mask="0x00000001" name="DIFF0"/>
          <bitfield caption="Differential Inputs for Channel 1" mask="0x00000002" name="DIFF1"/>
          <bitfield caption="Differential Inputs for Channel 2" mask="0x00000004" name="DIFF2"/>
          <bitfield caption="Differential Inputs for Channel 3" mask="0x00000008" name="DIFF3"/>
          <bitfield caption="Differential Inputs for Channel 4" mask="0x00000010" name="DIFF4"/>
          <bitfield caption="Differential Inputs for Channel 5" mask="0x00000020" name="DIFF5"/>
          <bitfield caption="Differential Inputs for Channel 6" mask="0x00000040" name="DIFF6"/>
          <bitfield caption="Differential Inputs for Channel 7" mask="0x00000080" name="DIFF7"/>
        </register>
        <register caption="Channel Data Register" name="ADC_CDR" offset="0x60" rw="R" size="4" count="8">
          <bitfield caption="Converted Data" mask="0x0000FFFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0xE0" rw="RW" size="4">
          <bitfield caption="VBAT Resistive Load Selection" mask="0x00000004" name="ZBAT"/>
          <bitfield caption="ADC Internal Positive Voltage Reference Enable" mask="0x00100000" name="INTVREFEN"/>
          <bitfield caption="Supply Monitor Enable" mask="0x00200000" name="SMEN"/>
          <bitfield caption="Supply Monitor Voltage Threshold" mask="0x00400000" name="SMVT"/>
        </register>
        <register caption="FIFO Mode Register" name="ADC_FMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Enable FIFO" mask="0x00000001" name="ENFIFO" values="ADC_FMR__ENFIFO"/>
          <bitfield caption="Enable Level" mask="0x00000002" name="ENLEVEL" values="ADC_FMR__ENLEVEL"/>
          <bitfield caption="Chunk Size" mask="0x000000F0" name="CHUNK"/>
          <bitfield caption="FIFO Count (read-only)" mask="0x00FF0000" name="FIFOCNT"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="ADC_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ADC_PWPMR__WPKEY"/>
        </register>
