Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG128.atdf
        <register caption="Extended Mode Register" name="AESB_EMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Private Key Write Once" mask="0x00000040" name="PKWO"/>
          <bitfield caption="Private Key Internal Register Select" mask="0x00000080" name="PKRS"/>
        </register>
        <register caption="Write Protection Mode Register" name="AESB_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="First Error Report Enable" mask="0x00000010" name="FIRSTE"/>
          <bitfield caption="Action on Abnormal Event Detection" mask="0x000000E0" name="ACTION" values="AESB_WPMR__ACTION"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="AESB_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="AESB_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Private Key Internal Register Protection Violation Status (cleared on read)" mask="0x00000010" name="PKRPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="AESB_WPSR__SWETYP"/>
          <bitfield caption="Software Error Class (cleared on read)" mask="0x80000000" name="ECLASS" values="AESB_WPSR__ECLASS"/>
        </register>
      </register-group>
      <value-group caption="Dual Input Buffer" name="AESB_MR__DUALBUFF">
        <value caption="AESB_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0x0"/>
        <value caption="AESB_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files." name="ACTIVE" value="0x1"/>
      </value-group>
      <value-group caption="Start Mode" name="AESB_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="AESB_IDATAR0 access only Auto mode" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Operating Mode" name="AESB_MR__OPMOD">
        <value caption="Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
      </value-group>
      <value-group caption="Key" name="AESB_MR__CKEY">
        <value caption="Must be written with 0xE the first time that AESB_MR is programmed. For subsequent programming of AESB_MR, any value can be written, including that of 0xE. Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="Unspecified Register Access" name="AESB_ISR__URAT">
        <value caption="Input Data register written during the data processing when SMOD = 0x2 mode" name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data register read during the data processing" name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode register written during the data processing" name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data register read during the sub-keys generation" name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode register written during the sub-keys generation" name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access" name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
      <value-group caption="Action on Abnormal Event Detection" name="AESB_WPMR__ACTION">
        <value caption="No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set." name="REPORT_ONLY" value="0x0"/>
        <value caption="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." name="LOCK_PKRPVS_WPVS_SWE" value="0x1"/>
        <value caption="If a processing is in progress when the AESB_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." name="LOCK_CGD_SEQE" value="0x2"/>
        <value caption="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." name="LOCK_ANY_EV" value="0x3"/>
        <value caption="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." name="CLEAR_PKRPVS_WPVS_SWE" value="0x4"/>
        <value caption="If a processing is in progress when the AESB_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." name="CLEAR_CGD_SEQE" value="0x5"/>
        <value caption="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." name="CLEAR_ANY_EV" value="0x6"/>
      </value-group>
      <value-group caption="Write Protection Key" name="AESB_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." name="PASSWD" value="0x414553"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="AESB_WPSR__SWETYP">
        <value caption="A write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="AESB is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address (Warning)." name="UNDEF_RW" value="0x2"/>
        <value caption="Abnormal use of AESB_CR.START command when DMA access is configured." name="CTRL_START" value="0x3"/>
        <value caption="A Private Key Bus access, key write, init value write, output data read or AESB_MR and AESB_EMR write has been performed while a process is in progress (abnormal)." name="WEIRD_ACTION" value="0x4"/>
        <value caption="A tentative of start is required while the key is not fully loaded into the AESB_KEYWRx registers." name="INCOMPLETE_KEY" value="0x5"/>
      </value-group>
      <value-group caption="Software Error Class (cleared on read)" name="AESB_WPSR__ECLASS">
        <value caption="An abnormal access that does not affect system functionality" name="WARNING" value="0"/>
        <value caption="An access is performed into key, input data, control registers while the AESB is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured." name="ERROR" value="1"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" id="6417" version="ZW">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
