Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG128.atdf
        <register caption="Watchdog 1 Interrupt Disable Register" name="WDT1_IDR" offset="0x0018" rw="W" size="4">
          <bitfield caption="Overflow Period Interrupt Disable" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Disable" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Disable" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Reload Command Error Interrupt Disable" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 1 Interrupt Status Register" name="WDT1_ISR" offset="0x001C" rw="R" size="4">
          <bitfield caption="Overflow Period Status (cleared on read)" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Status (cleared on read)" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Status (cleared on read)" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Reload Command Error Status (cleared on read)" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 1 Interrupt Mask Register" name="WDT1_IMR" offset="0x0020" rw="R" size="4">
          <bitfield caption="Overflow Period Interrupt Mask" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Mask" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Mask" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Reload Command Error Interrupt Mask" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 0 Control Register" name="WDT0_CR" offset="0x1210" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Lock Mode Register Write Access" mask="0x00000010" name="LOCKMR"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT0_CR__KEY"/>
        </register>
        <register caption="Watchdog 0 Mode Register" name="WDT0_MR" offset="0x1214" rw="RW" size="4">
          <bitfield caption="Period Reset" mask="0x00000010" name="PERIODRST"/>
          <bitfield caption="Repeat Threshold Reset" mask="0x00000020" name="RPTHRST"/>
          <bitfield caption="Watchdog NRST Disable" mask="0x00000200" name="WDNRSTDIS"/>
          <bitfield caption="Watchdog Disable" mask="0x00001000" name="WDDIS"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x10000000" name="WDIDLEHLT"/>
          <bitfield caption="Watchdog Core 0 Debug Halt" mask="0x20000000" name="WDDBG0HLT"/>
          <bitfield caption="Watchdog Core 1 Debug Halt" mask="0x40000000" name="WDDBG1HLT"/>
        </register>
        <register caption="Watchdog 0 Value Register" name="WDT0_VR" offset="0x1218" rw="R" size="4">
          <bitfield caption="Watchdog Down Counter Value" mask="0x00000FFF" name="COUNTER"/>
        </register>
        <register caption="Watchdog 0 Window Level" name="WDT0_WL" offset="0x121C" rw="RW" size="4">
          <bitfield caption="Watchdog Period" mask="0x00000FFF" name="PERIOD"/>
          <bitfield caption="Repeat Threshold" mask="0x0FFF0000" name="RPTH"/>
        </register>
        <register caption="Watchdog 0 Interrupt Level" name="WDT0_IL" offset="0x1220" rw="RW" size="4">
          <bitfield caption="Level Threshold" mask="0x00000FFF" name="LVLTH"/>
          <bitfield caption="Prescaler Ratio" mask="0x00070000" name="PRESC" values="WDT0_IL__PRESC"/>
        </register>
        <register caption="Watchdog 0 Interrupt Enable Register" name="WDT0_IER" offset="0x1224" rw="W" size="4">
          <bitfield caption="Overflow Period Interrupt Enable" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Enable" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Enable" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Watchdog 1 Overflow Interrupt Enable" mask="0x00000008" name="W1PERINT"/>
          <bitfield caption="Watchdog 1 Repeat Threshold Interrupt Enable" mask="0x00000010" name="W1RPTHINT"/>
          <bitfield caption="Reload Command Error Interrupt Enable" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 0 Interrupt Disable Register" name="WDT0_IDR" offset="0x1228" rw="W" size="4">
          <bitfield caption="Overflow Period Interrupt Disable" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Disable" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Disable" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Watchdog 1 Overflow Interrupt Disable" mask="0x00000008" name="W1PERINT"/>
          <bitfield caption="Watchdog 1 Repeat Threshold Interrupt Disable" mask="0x00000010" name="W1RPTHINT"/>
          <bitfield caption="Reload Command Error Interrupt Disable" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 0 Interrupt Status Register" name="WDT0_ISR" offset="0x122C" rw="R" size="4">
          <bitfield caption="Overflow Period Status (cleared on read)" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Status (cleared on read)" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Status (cleared on read)" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Watchdog 1 Overflow Interrupt Status" mask="0x00000008" name="W1PERINT"/>
          <bitfield caption="Watchdog 1 Repeat Threshold Interrupt Status" mask="0x00000010" name="W1RPTHINT"/>
          <bitfield caption="Reload Command Error Status (cleared on read)" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 0 Interrupt Mask Register" name="WDT0_IMR" offset="0x1230" rw="R" size="4">
          <bitfield caption="Overflow Period Interrupt Mask" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Mask" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Mask" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Watchdog 1 Overflow Interrupt Mask" mask="0x00000008" name="W1PERINT"/>
          <bitfield caption="Watchdog 1 Repeat Threshold Interrupt Mask" mask="0x00000010" name="W1RPTHINT"/>
          <bitfield caption="Reload Command Error Interrupt Mask" mask="0x00000020" name="RLDERR"/>
        </register>
        <register caption="Watchdog 1 Level Limits Register" name="WDT1_LVLLIM" offset="0x1234" rw="RW" size="4">
          <bitfield caption="Minimum Level" mask="0x00000FFF" name="LVLMIN"/>
          <bitfield caption="Maximum Level" mask="0x0FFF0000" name="LVLMAX"/>
        </register>
        <register caption="Watchdog 1 Repeat Limits Register" name="WDT1_RLIM" offset="0x1238" rw="RW" size="4">
          <bitfield caption="Minimum Repeat Threshold" mask="0x00000FFF" name="RPTHMIN"/>
          <bitfield caption="Maximum Repeat Threshold" mask="0x0FFF0000" name="RPTHMAX"/>
        </register>
        <register caption="Watchdog 1 Period Limits Register" name="WDT1_PLIM" offset="0x123C" rw="RW" size="4">
          <bitfield caption="Minimum Period" mask="0x00000FFF" name="PERMIN"/>
          <bitfield caption="Maximum Period" mask="0x0FFF0000" name="PERMAX"/>
        </register>
      </register-group>
