Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX2051MTG128.atdf
        <register caption="Lock Bits Word 2" name="LOCKBIT_WORD2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Lock Region 64" mask="0x00000001" name="LOCK_REGION_64"/>
          <bitfield caption="Lock Region 65" mask="0x00000002" name="LOCK_REGION_65"/>
          <bitfield caption="Lock Region 66" mask="0x00000004" name="LOCK_REGION_66"/>
          <bitfield caption="Lock Region 67" mask="0x00000008" name="LOCK_REGION_67"/>
          <bitfield caption="Lock Region 68" mask="0x00000010" name="LOCK_REGION_68"/>
          <bitfield caption="Lock Region 69" mask="0x00000020" name="LOCK_REGION_69"/>
          <bitfield caption="Lock Region 70" mask="0x00000040" name="LOCK_REGION_70"/>
          <bitfield caption="Lock Region 71" mask="0x00000080" name="LOCK_REGION_71"/>
          <bitfield caption="Lock Region 72" mask="0x00000100" name="LOCK_REGION_72"/>
          <bitfield caption="Lock Region 73" mask="0x00000200" name="LOCK_REGION_73"/>
          <bitfield caption="Lock Region 74" mask="0x00000400" name="LOCK_REGION_74"/>
          <bitfield caption="Lock Region 75" mask="0x00000800" name="LOCK_REGION_75"/>
          <bitfield caption="Lock Region 76" mask="0x00001000" name="LOCK_REGION_76"/>
          <bitfield caption="Lock Region 77" mask="0x00002000" name="LOCK_REGION_77"/>
          <bitfield caption="Lock Region 78" mask="0x00004000" name="LOCK_REGION_78"/>
          <bitfield caption="Lock Region 79" mask="0x00008000" name="LOCK_REGION_79"/>
          <bitfield caption="Lock Region 80" mask="0x00010000" name="LOCK_REGION_80"/>
          <bitfield caption="Lock Region 81" mask="0x00020000" name="LOCK_REGION_81"/>
          <bitfield caption="Lock Region 82" mask="0x00040000" name="LOCK_REGION_82"/>
          <bitfield caption="Lock Region 83" mask="0x00080000" name="LOCK_REGION_83"/>
          <bitfield caption="Lock Region 84" mask="0x00100000" name="LOCK_REGION_84"/>
          <bitfield caption="Lock Region 85" mask="0x00200000" name="LOCK_REGION_85"/>
          <bitfield caption="Lock Region 86" mask="0x00400000" name="LOCK_REGION_86"/>
          <bitfield caption="Lock Region 87" mask="0x00800000" name="LOCK_REGION_87"/>
          <bitfield caption="Lock Region 88" mask="0x01000000" name="LOCK_REGION_88"/>
          <bitfield caption="Lock Region 89" mask="0x02000000" name="LOCK_REGION_89"/>
          <bitfield caption="Lock Region 90" mask="0x04000000" name="LOCK_REGION_90"/>
          <bitfield caption="Lock Region 91" mask="0x08000000" name="LOCK_REGION_91"/>
          <bitfield caption="Lock Region 92" mask="0x10000000" name="LOCK_REGION_92"/>
          <bitfield caption="Lock Region 93" mask="0x20000000" name="LOCK_REGION_93"/>
          <bitfield caption="Lock Region 94" mask="0x40000000" name="LOCK_REGION_94"/>
          <bitfield caption="Lock Region 95" mask="0x80000000" name="LOCK_REGION_95"/>
        </register>
        <register caption="Lock Bits Word 3" name="LOCKBIT_WORD3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Lock Region 96" mask="0x00000001" name="LOCK_REGION_96"/>
          <bitfield caption="Lock Region 97" mask="0x00000002" name="LOCK_REGION_97"/>
          <bitfield caption="Lock Region 98" mask="0x00000004" name="LOCK_REGION_98"/>
          <bitfield caption="Lock Region 99" mask="0x00000008" name="LOCK_REGION_99"/>
          <bitfield caption="Lock Region 100" mask="0x00000010" name="LOCK_REGION_100"/>
          <bitfield caption="Lock Region 101" mask="0x00000020" name="LOCK_REGION_101"/>
          <bitfield caption="Lock Region 102" mask="0x00000040" name="LOCK_REGION_102"/>
          <bitfield caption="Lock Region 103" mask="0x00000080" name="LOCK_REGION_103"/>
          <bitfield caption="Lock Region 104" mask="0x00000100" name="LOCK_REGION_104"/>
          <bitfield caption="Lock Region 105" mask="0x00000200" name="LOCK_REGION_105"/>
          <bitfield caption="Lock Region 106" mask="0x00000400" name="LOCK_REGION_106"/>
          <bitfield caption="Lock Region 107" mask="0x00000800" name="LOCK_REGION_107"/>
          <bitfield caption="Lock Region 108" mask="0x00001000" name="LOCK_REGION_108"/>
          <bitfield caption="Lock Region 109" mask="0x00002000" name="LOCK_REGION_109"/>
          <bitfield caption="Lock Region 110" mask="0x00004000" name="LOCK_REGION_110"/>
          <bitfield caption="Lock Region 111" mask="0x00008000" name="LOCK_REGION_111"/>
          <bitfield caption="Lock Region 112" mask="0x00010000" name="LOCK_REGION_112"/>
          <bitfield caption="Lock Region 113" mask="0x00020000" name="LOCK_REGION_113"/>
          <bitfield caption="Lock Region 114" mask="0x00040000" name="LOCK_REGION_114"/>
          <bitfield caption="Lock Region 115" mask="0x00080000" name="LOCK_REGION_115"/>
          <bitfield caption="Lock Region 116" mask="0x00100000" name="LOCK_REGION_116"/>
          <bitfield caption="Lock Region 117" mask="0x00200000" name="LOCK_REGION_117"/>
          <bitfield caption="Lock Region 118" mask="0x00400000" name="LOCK_REGION_118"/>
          <bitfield caption="Lock Region 119" mask="0x00800000" name="LOCK_REGION_119"/>
          <bitfield caption="Lock Region 120" mask="0x01000000" name="LOCK_REGION_120"/>
          <bitfield caption="Lock Region 121" mask="0x02000000" name="LOCK_REGION_121"/>
          <bitfield caption="Lock Region 122" mask="0x04000000" name="LOCK_REGION_122"/>
          <bitfield caption="Lock Region 123" mask="0x08000000" name="LOCK_REGION_123"/>
          <bitfield caption="Lock Region 124" mask="0x10000000" name="LOCK_REGION_124"/>
          <bitfield caption="Lock Region 125" mask="0x20000000" name="LOCK_REGION_125"/>
          <bitfield caption="Lock Region 126" mask="0x40000000" name="LOCK_REGION_126"/>
          <bitfield caption="Lock Region 127" mask="0x80000000" name="LOCK_REGION_127"/>
        </register>
        <register caption="Lock Bits Word 4" name="LOCKBIT_WORD4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Lock Region 128" mask="0x00000001" name="LOCK_REGION_128"/>
          <bitfield caption="Lock Region 129" mask="0x00000002" name="LOCK_REGION_129"/>
          <bitfield caption="Lock Region 130" mask="0x00000004" name="LOCK_REGION_130"/>
          <bitfield caption="Lock Region 131" mask="0x00000008" name="LOCK_REGION_131"/>
          <bitfield caption="Lock Region 132" mask="0x00000010" name="LOCK_REGION_132"/>
          <bitfield caption="Lock Region 133" mask="0x00000020" name="LOCK_REGION_133"/>
          <bitfield caption="Lock Region 134" mask="0x00000040" name="LOCK_REGION_134"/>
          <bitfield caption="Lock Region 135" mask="0x00000080" name="LOCK_REGION_135"/>
          <bitfield caption="Lock Region 136" mask="0x00000100" name="LOCK_REGION_136"/>
          <bitfield caption="Lock Region 137" mask="0x00000200" name="LOCK_REGION_137"/>
          <bitfield caption="Lock Region 138" mask="0x00000400" name="LOCK_REGION_138"/>
          <bitfield caption="Lock Region 139" mask="0x00000800" name="LOCK_REGION_139"/>
          <bitfield caption="Lock Region 140" mask="0x00001000" name="LOCK_REGION_140"/>
          <bitfield caption="Lock Region 141" mask="0x00002000" name="LOCK_REGION_141"/>
          <bitfield caption="Lock Region 142" mask="0x00004000" name="LOCK_REGION_142"/>
          <bitfield caption="Lock Region 143" mask="0x00008000" name="LOCK_REGION_143"/>
          <bitfield caption="Lock Region 144" mask="0x00010000" name="LOCK_REGION_144"/>
          <bitfield caption="Lock Region 145" mask="0x00020000" name="LOCK_REGION_145"/>
          <bitfield caption="Lock Region 146" mask="0x00040000" name="LOCK_REGION_146"/>
          <bitfield caption="Lock Region 147" mask="0x00080000" name="LOCK_REGION_147"/>
          <bitfield caption="Lock Region 148" mask="0x00100000" name="LOCK_REGION_148"/>
          <bitfield caption="Lock Region 149" mask="0x00200000" name="LOCK_REGION_149"/>
          <bitfield caption="Lock Region 150" mask="0x00400000" name="LOCK_REGION_150"/>
          <bitfield caption="Lock Region 151" mask="0x00800000" name="LOCK_REGION_151"/>
          <bitfield caption="Lock Region 152" mask="0x01000000" name="LOCK_REGION_152"/>
          <bitfield caption="Lock Region 153" mask="0x02000000" name="LOCK_REGION_153"/>
          <bitfield caption="Lock Region 154" mask="0x04000000" name="LOCK_REGION_154"/>
          <bitfield caption="Lock Region 155" mask="0x08000000" name="LOCK_REGION_155"/>
          <bitfield caption="Lock Region 156" mask="0x10000000" name="LOCK_REGION_156"/>
          <bitfield caption="Lock Region 157" mask="0x20000000" name="LOCK_REGION_157"/>
          <bitfield caption="Lock Region 158" mask="0x40000000" name="LOCK_REGION_158"/>
          <bitfield caption="Lock Region 159" mask="0x80000000" name="LOCK_REGION_159"/>
        </register>
        <register caption="Lock Bits Word 5" name="LOCKBIT_WORD5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Lock Region 160" mask="0x00000001" name="LOCK_REGION_160"/>
          <bitfield caption="Lock Region 161" mask="0x00000002" name="LOCK_REGION_161"/>
          <bitfield caption="Lock Region 162" mask="0x00000004" name="LOCK_REGION_162"/>
          <bitfield caption="Lock Region 163" mask="0x00000008" name="LOCK_REGION_163"/>
          <bitfield caption="Lock Region 164" mask="0x00000010" name="LOCK_REGION_164"/>
          <bitfield caption="Lock Region 165" mask="0x00000020" name="LOCK_REGION_165"/>
          <bitfield caption="Lock Region 166" mask="0x00000040" name="LOCK_REGION_166"/>
          <bitfield caption="Lock Region 167" mask="0x00000080" name="LOCK_REGION_167"/>
          <bitfield caption="Lock Region 168" mask="0x00000100" name="LOCK_REGION_168"/>
          <bitfield caption="Lock Region 169" mask="0x00000200" name="LOCK_REGION_169"/>
          <bitfield caption="Lock Region 170" mask="0x00000400" name="LOCK_REGION_170"/>
          <bitfield caption="Lock Region 171" mask="0x00000800" name="LOCK_REGION_171"/>
          <bitfield caption="Lock Region 172" mask="0x00001000" name="LOCK_REGION_172"/>
          <bitfield caption="Lock Region 173" mask="0x00002000" name="LOCK_REGION_173"/>
          <bitfield caption="Lock Region 174" mask="0x00004000" name="LOCK_REGION_174"/>
          <bitfield caption="Lock Region 175" mask="0x00008000" name="LOCK_REGION_175"/>
          <bitfield caption="Lock Region 176" mask="0x00010000" name="LOCK_REGION_176"/>
          <bitfield caption="Lock Region 177" mask="0x00020000" name="LOCK_REGION_177"/>
          <bitfield caption="Lock Region 178" mask="0x00040000" name="LOCK_REGION_178"/>
          <bitfield caption="Lock Region 179" mask="0x00080000" name="LOCK_REGION_179"/>
          <bitfield caption="Lock Region 180" mask="0x00100000" name="LOCK_REGION_180"/>
          <bitfield caption="Lock Region 181" mask="0x00200000" name="LOCK_REGION_181"/>
          <bitfield caption="Lock Region 182" mask="0x00400000" name="LOCK_REGION_182"/>
          <bitfield caption="Lock Region 183" mask="0x00800000" name="LOCK_REGION_183"/>
          <bitfield caption="Lock Region 184" mask="0x01000000" name="LOCK_REGION_184"/>
          <bitfield caption="Lock Region 185" mask="0x02000000" name="LOCK_REGION_185"/>
          <bitfield caption="Lock Region 186" mask="0x04000000" name="LOCK_REGION_186"/>
          <bitfield caption="Lock Region 187" mask="0x08000000" name="LOCK_REGION_187"/>
          <bitfield caption="Lock Region 188" mask="0x10000000" name="LOCK_REGION_188"/>
          <bitfield caption="Lock Region 189" mask="0x20000000" name="LOCK_REGION_189"/>
          <bitfield caption="Lock Region 190" mask="0x40000000" name="LOCK_REGION_190"/>
          <bitfield caption="Lock Region 191" mask="0x80000000" name="LOCK_REGION_191"/>
        </register>
        <register caption="Lock Bits Word 6" name="LOCKBIT_WORD6" offset="0x18" rw="RW" size="4">
          <bitfield caption="Lock Region 192" mask="0x00000001" name="LOCK_REGION_192"/>
          <bitfield caption="Lock Region 193" mask="0x00000002" name="LOCK_REGION_193"/>
          <bitfield caption="Lock Region 194" mask="0x00000004" name="LOCK_REGION_194"/>
          <bitfield caption="Lock Region 195" mask="0x00000008" name="LOCK_REGION_195"/>
          <bitfield caption="Lock Region 196" mask="0x00000010" name="LOCK_REGION_196"/>
          <bitfield caption="Lock Region 197" mask="0x00000020" name="LOCK_REGION_197"/>
          <bitfield caption="Lock Region 198" mask="0x00000040" name="LOCK_REGION_198"/>
          <bitfield caption="Lock Region 199" mask="0x00000080" name="LOCK_REGION_199"/>
          <bitfield caption="Lock Region 200" mask="0x00000100" name="LOCK_REGION_200"/>
          <bitfield caption="Lock Region 201" mask="0x00000200" name="LOCK_REGION_201"/>
          <bitfield caption="Lock Region 202" mask="0x00000400" name="LOCK_REGION_202"/>
          <bitfield caption="Lock Region 203" mask="0x00000800" name="LOCK_REGION_203"/>
          <bitfield caption="Lock Region 204" mask="0x00001000" name="LOCK_REGION_204"/>
          <bitfield caption="Lock Region 205" mask="0x00002000" name="LOCK_REGION_205"/>
          <bitfield caption="Lock Region 206" mask="0x00004000" name="LOCK_REGION_206"/>
          <bitfield caption="Lock Region 207" mask="0x00008000" name="LOCK_REGION_207"/>
          <bitfield caption="Lock Region 208" mask="0x00010000" name="LOCK_REGION_208"/>
          <bitfield caption="Lock Region 209" mask="0x00020000" name="LOCK_REGION_209"/>
          <bitfield caption="Lock Region 210" mask="0x00040000" name="LOCK_REGION_210"/>
          <bitfield caption="Lock Region 211" mask="0x00080000" name="LOCK_REGION_211"/>
          <bitfield caption="Lock Region 212" mask="0x00100000" name="LOCK_REGION_212"/>
          <bitfield caption="Lock Region 213" mask="0x00200000" name="LOCK_REGION_213"/>
          <bitfield caption="Lock Region 214" mask="0x00400000" name="LOCK_REGION_214"/>
          <bitfield caption="Lock Region 215" mask="0x00800000" name="LOCK_REGION_215"/>
          <bitfield caption="Lock Region 216" mask="0x01000000" name="LOCK_REGION_216"/>
          <bitfield caption="Lock Region 217" mask="0x02000000" name="LOCK_REGION_217"/>
          <bitfield caption="Lock Region 218" mask="0x04000000" name="LOCK_REGION_218"/>
          <bitfield caption="Lock Region 219" mask="0x08000000" name="LOCK_REGION_219"/>
          <bitfield caption="Lock Region 220" mask="0x10000000" name="LOCK_REGION_220"/>
          <bitfield caption="Lock Region 221" mask="0x20000000" name="LOCK_REGION_221"/>
          <bitfield caption="Lock Region 222" mask="0x40000000" name="LOCK_REGION_222"/>
          <bitfield caption="Lock Region 223" mask="0x80000000" name="LOCK_REGION_223"/>
        </register>
        <register caption="Lock Bits Word 7" name="LOCKBIT_WORD7" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Lock Region 224" mask="0x00000001" name="LOCK_REGION_224"/>
          <bitfield caption="Lock Region 225" mask="0x00000002" name="LOCK_REGION_225"/>
          <bitfield caption="Lock Region 226" mask="0x00000004" name="LOCK_REGION_226"/>
          <bitfield caption="Lock Region 227" mask="0x00000008" name="LOCK_REGION_227"/>
          <bitfield caption="Lock Region 228" mask="0x00000010" name="LOCK_REGION_228"/>
          <bitfield caption="Lock Region 229" mask="0x00000020" name="LOCK_REGION_229"/>
          <bitfield caption="Lock Region 230" mask="0x00000040" name="LOCK_REGION_230"/>
          <bitfield caption="Lock Region 231" mask="0x00000080" name="LOCK_REGION_231"/>
          <bitfield caption="Lock Region 232" mask="0x00000100" name="LOCK_REGION_232"/>
          <bitfield caption="Lock Region 233" mask="0x00000200" name="LOCK_REGION_233"/>
          <bitfield caption="Lock Region 234" mask="0x00000400" name="LOCK_REGION_234"/>
          <bitfield caption="Lock Region 235" mask="0x00000800" name="LOCK_REGION_235"/>
          <bitfield caption="Lock Region 236" mask="0x00001000" name="LOCK_REGION_236"/>
          <bitfield caption="Lock Region 237" mask="0x00002000" name="LOCK_REGION_237"/>
          <bitfield caption="Lock Region 238" mask="0x00004000" name="LOCK_REGION_238"/>
          <bitfield caption="Lock Region 239" mask="0x00008000" name="LOCK_REGION_239"/>
          <bitfield caption="Lock Region 240" mask="0x00010000" name="LOCK_REGION_240"/>
          <bitfield caption="Lock Region 241" mask="0x00020000" name="LOCK_REGION_241"/>
          <bitfield caption="Lock Region 242" mask="0x00040000" name="LOCK_REGION_242"/>
          <bitfield caption="Lock Region 243" mask="0x00080000" name="LOCK_REGION_243"/>
          <bitfield caption="Lock Region 244" mask="0x00100000" name="LOCK_REGION_244"/>
          <bitfield caption="Lock Region 245" mask="0x00200000" name="LOCK_REGION_245"/>
          <bitfield caption="Lock Region 246" mask="0x00400000" name="LOCK_REGION_246"/>
          <bitfield caption="Lock Region 247" mask="0x00800000" name="LOCK_REGION_247"/>
          <bitfield caption="Lock Region 248" mask="0x01000000" name="LOCK_REGION_248"/>
          <bitfield caption="Lock Region 249" mask="0x02000000" name="LOCK_REGION_249"/>
          <bitfield caption="Lock Region 250" mask="0x04000000" name="LOCK_REGION_250"/>
          <bitfield caption="Lock Region 251" mask="0x08000000" name="LOCK_REGION_251"/>
          <bitfield caption="Lock Region 252" mask="0x10000000" name="LOCK_REGION_252"/>
          <bitfield caption="Lock Region 253" mask="0x20000000" name="LOCK_REGION_253"/>
          <bitfield caption="Lock Region 254" mask="0x40000000" name="LOCK_REGION_254"/>
          <bitfield caption="Lock Region 255" mask="0x80000000" name="LOCK_REGION_255"/>
        </register>
        <register caption="Lock Bits Word 8" name="LOCKBIT_WORD8" offset="0x20" rw="RW" size="4">
          <bitfield caption="Lock Region 256" mask="0x00000001" name="LOCK_REGION_256"/>
          <bitfield caption="Lock Region 257" mask="0x00000002" name="LOCK_REGION_257"/>
          <bitfield caption="Lock Region 258" mask="0x00000004" name="LOCK_REGION_258"/>
          <bitfield caption="Lock Region 259" mask="0x00000008" name="LOCK_REGION_259"/>
          <bitfield caption="Lock Region 260" mask="0x00000010" name="LOCK_REGION_260"/>
          <bitfield caption="Lock Region 261" mask="0x00000020" name="LOCK_REGION_261"/>
          <bitfield caption="Lock Region 262" mask="0x00000040" name="LOCK_REGION_262"/>
          <bitfield caption="Lock Region 263" mask="0x00000080" name="LOCK_REGION_263"/>
          <bitfield caption="Lock Region 264" mask="0x00000100" name="LOCK_REGION_264"/>
          <bitfield caption="Lock Region 265" mask="0x00000200" name="LOCK_REGION_265"/>
          <bitfield caption="Lock Region 266" mask="0x00000400" name="LOCK_REGION_266"/>
          <bitfield caption="Lock Region 267" mask="0x00000800" name="LOCK_REGION_267"/>
          <bitfield caption="Lock Region 268" mask="0x00001000" name="LOCK_REGION_268"/>
          <bitfield caption="Lock Region 269" mask="0x00002000" name="LOCK_REGION_269"/>
          <bitfield caption="Lock Region 270" mask="0x00004000" name="LOCK_REGION_270"/>
          <bitfield caption="Lock Region 271" mask="0x00008000" name="LOCK_REGION_271"/>
          <bitfield caption="Lock Region 272" mask="0x00010000" name="LOCK_REGION_272"/>
          <bitfield caption="Lock Region 273" mask="0x00020000" name="LOCK_REGION_273"/>
          <bitfield caption="Lock Region 274" mask="0x00040000" name="LOCK_REGION_274"/>
          <bitfield caption="Lock Region 275" mask="0x00080000" name="LOCK_REGION_275"/>
          <bitfield caption="Lock Region 276" mask="0x00100000" name="LOCK_REGION_276"/>
          <bitfield caption="Lock Region 277" mask="0x00200000" name="LOCK_REGION_277"/>
          <bitfield caption="Lock Region 278" mask="0x00400000" name="LOCK_REGION_278"/>
          <bitfield caption="Lock Region 279" mask="0x00800000" name="LOCK_REGION_279"/>
          <bitfield caption="Lock Region 280" mask="0x01000000" name="LOCK_REGION_280"/>
          <bitfield caption="Lock Region 281" mask="0x02000000" name="LOCK_REGION_281"/>
          <bitfield caption="Lock Region 282" mask="0x04000000" name="LOCK_REGION_282"/>
          <bitfield caption="Lock Region 283" mask="0x08000000" name="LOCK_REGION_283"/>
          <bitfield caption="Lock Region 284" mask="0x10000000" name="LOCK_REGION_284"/>
          <bitfield caption="Lock Region 285" mask="0x20000000" name="LOCK_REGION_285"/>
          <bitfield caption="Lock Region 286" mask="0x40000000" name="LOCK_REGION_286"/>
          <bitfield caption="Lock Region 287" mask="0x80000000" name="LOCK_REGION_287"/>
        </register>
        <register caption="Lock Bits Word 9" name="LOCKBIT_WORD9" offset="0x24" rw="RW" size="4">
          <bitfield caption="Lock Region 288" mask="0x00000001" name="LOCK_REGION_288"/>
          <bitfield caption="Lock Region 289" mask="0x00000002" name="LOCK_REGION_289"/>
          <bitfield caption="Lock Region 290" mask="0x00000004" name="LOCK_REGION_290"/>
          <bitfield caption="Lock Region 291" mask="0x00000008" name="LOCK_REGION_291"/>
          <bitfield caption="Lock Region 292" mask="0x00000010" name="LOCK_REGION_292"/>
          <bitfield caption="Lock Region 293" mask="0x00000020" name="LOCK_REGION_293"/>
          <bitfield caption="Lock Region 294" mask="0x00000040" name="LOCK_REGION_294"/>
          <bitfield caption="Lock Region 295" mask="0x00000080" name="LOCK_REGION_295"/>
          <bitfield caption="Lock Region 296" mask="0x00000100" name="LOCK_REGION_296"/>
          <bitfield caption="Lock Region 297" mask="0x00000200" name="LOCK_REGION_297"/>
          <bitfield caption="Lock Region 298" mask="0x00000400" name="LOCK_REGION_298"/>
          <bitfield caption="Lock Region 299" mask="0x00000800" name="LOCK_REGION_299"/>
          <bitfield caption="Lock Region 300" mask="0x00001000" name="LOCK_REGION_300"/>
          <bitfield caption="Lock Region 301" mask="0x00002000" name="LOCK_REGION_301"/>
          <bitfield caption="Lock Region 302" mask="0x00004000" name="LOCK_REGION_302"/>
          <bitfield caption="Lock Region 303" mask="0x00008000" name="LOCK_REGION_303"/>
          <bitfield caption="Lock Region 304" mask="0x00010000" name="LOCK_REGION_304"/>
          <bitfield caption="Lock Region 305" mask="0x00020000" name="LOCK_REGION_305"/>
          <bitfield caption="Lock Region 306" mask="0x00040000" name="LOCK_REGION_306"/>
          <bitfield caption="Lock Region 307" mask="0x00080000" name="LOCK_REGION_307"/>
          <bitfield caption="Lock Region 308" mask="0x00100000" name="LOCK_REGION_308"/>
          <bitfield caption="Lock Region 309" mask="0x00200000" name="LOCK_REGION_309"/>
          <bitfield caption="Lock Region 310" mask="0x00400000" name="LOCK_REGION_310"/>
          <bitfield caption="Lock Region 311" mask="0x00800000" name="LOCK_REGION_311"/>
          <bitfield caption="Lock Region 312" mask="0x01000000" name="LOCK_REGION_312"/>
          <bitfield caption="Lock Region 313" mask="0x02000000" name="LOCK_REGION_313"/>
          <bitfield caption="Lock Region 314" mask="0x04000000" name="LOCK_REGION_314"/>
          <bitfield caption="Lock Region 315" mask="0x08000000" name="LOCK_REGION_315"/>
          <bitfield caption="Lock Region 316" mask="0x10000000" name="LOCK_REGION_316"/>
          <bitfield caption="Lock Region 317" mask="0x20000000" name="LOCK_REGION_317"/>
          <bitfield caption="Lock Region 318" mask="0x40000000" name="LOCK_REGION_318"/>
          <bitfield caption="Lock Region 319" mask="0x80000000" name="LOCK_REGION_319"/>
        </register>
